Python 3.9.1 (tags/v3.9.1:1e5d33e, Dec  7 2020, 17:08:21) [MSC v.1927 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_14.py ========
3
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_14.py ========
3
4
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_14.py ========
3
4
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_14.py ========
3
4
2
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_14.py ========
3
4
5
2
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_14.py ========
3
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_14.py ========
3
4
2
5
2
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_15.py ========
[3, 5, 2, 1, 5, 3]
sort : [1, 2, 3, 3, 5, 5]
reverst : [5, 5, 3, 3, 2, 1]
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_16.py ========
['오렌지', 880]
오렌지
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_16.py ========
['오렌지', 880]
오렌지
[2, 20, 200]
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_16.py ========
['오렌지', 880]
오렌지
[2, 20, 200]
[[1, 2], [6, 7]]
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15.py ========
Traceback (most recent call last):
  File "C:/GitCollection/study/Python/python으로 시작하는/q5_15.py", line 5, in <module>
    bigdata.append(random.randint(1.33))
TypeError: randint() missing 1 required positional argument: 'b'
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15.py ========
[24, 21, 32, 17, 21, 5, 12, 3, 24, 19, 4, 24, 22, 11, 13, 2, 32, 22, 16, 14, 23, 16, 10, 22, 29, 33, 27, 11, 30, 33, 26, 13, 23, 26, 28, 16, 30, 2, 3, 16, 9, 16, 28, 11, 8, 22, 1, 3, 27, 24, 13, 33, 7, 14, 31, 26, 21, 14, 3, 15, 19, 13, 1, 15, 26, 24, 11, 22, 15, 7, 19, 16, 33, 28, 11, 24, 32, 10, 12, 7, 28, 23, 22, 10, 14, 1, 14, 2, 3, 24, 20, 18, 20, 31, 29, 16, 16, 4, 21, 23]
존재하지 않는 값(들): [6, 25]
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[18, 25, 23, 6, 29, 12, 3, 27, 31, 10, 10, 8, 32, 21, 18, 10, 32, 1, 20, 3, 7, 17, 8, 20, 13, 21, 31, 18, 13, 17, 24, 24, 30, 7, 25, 4, 7, 12, 13, 15, 28, 2, 15, 8, 18, 9, 8, 31, 14, 23, 1, 13, 6, 33, 3, 23, 6, 23, 30, 1, 15, 11, 25, 2, 17, 19, 27, 33, 8, 17, 5, 6, 4, 18, 5, 17, 23, 7, 2, 22, 29, 2, 11, 16, 25, 11, 6, 24, 6, 31, 14, 12, 5, 30, 20, 32, 24, 9, 13, 30]
존재하지 않는 값(들): []
>>> 

======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
>>> 
[26, 21, 30, 28, 4, 22, 3, 25, 2, 4, 17, 32, 32, 5, 27, 29, 17, 19, 20, 20, 22, 31, 4, 30, 24, 9, 10, 6, 25, 6, 20, 30, 8, 10, 16, 22, 32, 20, 4, 31, 26, 15, 23, 31, 26, 31, 4, 25, 7, 12, 10, 2, 11, 13, 31, 23, 9, 4, 23, 15, 4, 33, 28, 29, 20, 22, 19, 25, 30, 17, 6, 15, 9, 26, 2, 31, 31, 21, 11, 32, 24, 13, 21, 27, 22, 9, 16, 25, 30, 4, 32, 10, 19, 9, 22, 17, 21, 31, 30, 21]
존재하지 않는 값(들): []
>>> 

======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
>>> 
[3, 18, 11, 11, 27, 16, 3, 19, 2, 23, 30, 32, 31, 2, 31, 12, 11, 22, 6, 2, 4, 3, 6, 28, 9, 6, 18, 24, 19, 32, 20, 9, 29, 18, 33, 30, 5, 4, 8, 7, 26, 10, 11, 21, 26, 26, 33, 3, 5, 11, 15, 25, 4, 15, 3, 21, 18, 7, 12, 10, 26, 31, 24, 21, 7, 9, 33, 25, 27, 17, 21, 9, 19, 3, 20, 8, 28, 6, 3, 22, 32, 28, 8, 4, 27, 27, 29, 13, 12, 17, 33, 23, 8, 26, 21, 3, 22, 11, 30, 21]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[33, 32, 1, 4, 9, 8, 33, 33, 23, 1, 28, 7, 16, 25, 24, 12, 16, 24, 1, 1, 1, 22, 1, 33, 10, 16, 28, 19, 12, 30, 29, 3, 22, 16, 16, 2, 16, 14, 23, 28, 23, 21, 1, 1, 4, 32, 10, 13, 6, 31, 3, 19, 18, 30, 13, 10, 30, 21, 10, 1, 19, 19, 5, 32, 31, 23, 15, 10, 23, 5, 32, 20, 6, 6, 31, 23, 2, 11, 5, 33, 21, 31, 25, 30, 14, 12, 22, 20, 22, 11, 22, 26, 19, 23, 18, 2, 6, 25, 11, 1]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[22, 31, 6, 18, 19, 24, 4, 3, 21, 2, 8, 33, 21, 33, 4, 9, 17, 8, 32, 33, 32, 14, 14, 13, 15, 9, 33, 26, 24, 33, 2, 2, 28, 1, 4, 10, 31, 28, 5, 24, 25, 31, 22, 4, 22, 12, 33, 11, 16, 11, 31, 17, 23, 15, 8, 12, 6, 3, 25, 11, 9, 14, 4, 10, 30, 22, 5, 4, 14, 10, 32, 7, 25, 2, 22, 13, 21, 33, 22, 24, 27, 18, 32, 6, 27, 31, 18, 25, 10, 19, 26, 19, 1, 20, 21, 27, 21, 7, 9, 3]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[4, 23, 12, 32, 16, 20, 9, 27, 2, 10, 32, 24, 4, 15, 28, 9, 19, 17, 12, 30, 9, 9, 23, 4, 19, 6, 19, 6, 29, 14, 32, 29, 18, 29, 12, 27, 33, 21, 5, 20, 29, 22, 22, 19, 6, 1, 17, 11, 28, 7, 8, 22, 12, 15, 6, 8, 3, 17, 18, 17, 30, 20, 30, 24, 2, 17, 25, 14, 3, 24, 29, 17, 21, 20, 20, 10, 23, 19, 15, 31, 28, 19, 31, 2, 31, 4, 1, 22, 33, 16, 3, 23, 30, 3, 21, 28, 22, 10, 15, 17]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[27, 24, 7, 18, 14, 3, 8, 12, 29, 30, 13, 18, 8, 8, 9, 9, 32, 26, 25, 5, 21, 31, 15, 21, 6, 17, 32, 19, 12, 22, 17, 20, 26, 24, 8, 4, 6, 27, 8, 23, 24, 4, 13, 12, 1, 13, 17, 21, 28, 18, 14, 1, 11, 27, 5, 29, 26, 5, 29, 28, 29, 11, 15, 31, 24, 1, 18, 7, 3, 18, 18, 23, 20, 12, 31, 12, 30, 24, 33, 28, 30, 2, 17, 4, 2, 24, 32, 23, 29, 13, 16, 31, 4, 11, 30, 17, 17, 3, 24, 17]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[19, 16, 9, 21, 28, 15, 25, 18, 7, 15, 12, 23, 14, 22, 29, 25, 16, 22, 7, 31, 19, 23, 22, 14, 18, 11, 24, 3, 10, 29, 15, 17, 24, 4, 19, 15, 20, 24, 21, 27, 5, 14, 25, 4, 32, 15, 22, 4, 1, 32, 13, 10, 16, 14, 2, 32, 8, 32, 12, 25, 10, 3, 16, 12, 21, 9, 23, 32, 19, 24, 32, 24, 29, 14, 18, 3, 7, 30, 31, 11, 24, 1, 22, 13, 7, 1, 5, 20, 21, 11, 14, 33, 13, 6, 9, 25, 13, 2, 26, 25]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[7, 8, 26, 30, 10, 1, 23, 16, 3, 1, 29, 2, 16, 8, 7, 28, 32, 30, 25, 11, 23, 19, 11, 5, 10, 10, 12, 14, 23, 31, 33, 26, 18, 16, 32, 32, 26, 10, 5, 19, 20, 22, 14, 1, 28, 14, 23, 18, 19, 24, 10, 31, 6, 11, 2, 20, 7, 28, 12, 30, 4, 10, 3, 31, 16, 8, 6, 16, 33, 5, 1, 19, 13, 24, 20, 17, 16, 2, 10, 32, 26, 25, 20, 16, 12, 25, 1, 10, 33, 33, 26, 4, 28, 22, 12, 1, 3, 13, 21, 19]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[21, 15, 31, 16, 4, 7, 27, 31, 22, 26, 5, 7, 28, 17, 33, 9, 28, 33, 15, 26, 11, 18, 22, 32, 8, 29, 31, 18, 9, 13, 13, 29, 1, 25, 7, 8, 5, 6, 4, 32, 28, 18, 24, 29, 24, 31, 30, 28, 17, 30, 8, 27, 27, 11, 24, 17, 14, 28, 19, 25, 19, 16, 30, 32, 5, 13, 17, 23, 30, 20, 30, 16, 9, 13, 24, 27, 33, 2, 17, 31, 7, 28, 10, 20, 1, 12, 18, 22, 23, 19, 15, 3, 24, 1, 20, 7, 12, 18, 27, 26]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[29, 24, 32, 14, 19, 16, 9, 26, 33, 6, 10, 20, 4, 5, 33, 32, 18, 24, 16, 28, 26, 31, 33, 24, 7, 32, 11, 13, 4, 13, 28, 1, 3, 32, 5, 1, 4, 5, 33, 6, 9, 15, 5, 1, 30, 32, 8, 17, 2, 20, 25, 4, 27, 13, 4, 21, 19, 31, 24, 12, 32, 27, 15, 24, 5, 32, 18, 1, 30, 17, 18, 28, 26, 15, 1, 25, 21, 21, 4, 33, 28, 32, 2, 32, 2, 18, 11, 11, 29, 27, 7, 24, 22, 14, 31, 32, 29, 32, 20, 31]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[12, 23, 7, 30, 21, 5, 1, 33, 11, 6, 9, 31, 29, 17, 16, 28, 20, 31, 19, 20, 1, 9, 5, 2, 30, 5, 12, 28, 23, 14, 11, 29, 6, 6, 16, 18, 12, 3, 7, 5, 20, 10, 2, 15, 24, 13, 5, 20, 25, 13]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[26, 27, 2, 31, 11, 4, 4, 20, 1, 13, 30, 21, 31, 22, 17, 32, 28, 10, 26, 24, 23, 10, 15, 14, 5, 3, 16, 18, 18, 14, 18, 31, 14, 14, 5, 8, 17, 5, 28, 10, 27, 20, 16, 26, 21, 5, 33, 17, 9, 24]
존재하지 않는 값(들): []
>>> 

======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
>>> 
[13, 10, 22, 7, 28, 9, 3, 30, 16, 15, 19, 15, 21, 32, 25, 32, 9, 14, 30, 15, 9, 6, 9, 5, 21, 13, 10, 12, 11, 17, 27, 5, 5, 25, 29, 10, 17, 15, 5, 21, 28, 24, 26, 17, 33, 2, 17, 19, 4, 14]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[11, 1, 9, 18, 5, 13, 27, 26, 13, 6, 12, 28, 25, 3, 29, 2, 25, 2, 28, 32, 19, 30, 11, 2, 13, 31, 20, 29, 30, 24, 26, 23, 6, 8, 5, 15, 9, 25, 16, 7, 26, 30, 7, 22, 30, 15, 31, 10, 24, 1]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
>>> 
[33, 27, 6, 19, 14, 9, 19, 10, 9, 25, 19, 17, 10, 28, 17, 1, 12, 24, 25, 27, 3, 17, 30, 15, 2, 8, 9, 25, 19, 3, 6, 9, 8, 12, 21, 6, 15, 30, 29, 3, 8, 13, 1, 9, 19, 32, 4, 3, 26, 25]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[13, 4, 21, 28, 14, 26, 27, 25, 14, 15, 22, 4, 19, 18, 20, 27, 26, 21, 10, 32, 22, 33, 20, 4, 28, 15, 1, 26, 13, 18, 28, 3, 29, 29, 2, 14, 2, 6, 14, 16, 3, 5, 5, 25, 10, 10, 27, 17, 18, 25]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[25, 2, 29, 19, 28, 14, 20, 29, 17, 5, 10, 21, 6, 32, 17, 22, 1, 13, 30, 21, 11, 30, 24, 7, 32, 2, 29, 1, 7, 10, 23, 27, 7, 31, 32, 1, 18, 30, 16, 19, 4, 18, 27, 21, 22, 7, 26, 18, 27, 5]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[30, 28, 15, 31, 13, 4, 26, 3, 10, 16, 33, 21, 13, 8, 5, 27, 12, 28, 28, 17, 23, 22, 26, 29, 18, 22, 5, 32, 2, 13, 33, 32, 22, 3, 16, 3, 33, 31, 23, 15, 12, 29, 19, 23, 11, 3, 1, 10, 1, 30]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[23, 30, 1, 32, 12, 28, 6, 18, 7, 18, 8, 2, 15, 3, 31, 21, 24, 7, 10, 26, 12, 18, 3, 17, 33, 21, 21, 31, 6, 33, 17, 10, 1, 23, 5, 15, 32, 21, 14, 26, 4, 17, 8, 4, 32, 6, 18, 16, 23, 18]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[32, 12, 23, 28, 7, 24, 25, 11, 22, 33, 28, 3, 23, 9, 17, 10, 11, 32, 22, 9, 8, 11, 18, 7, 8, 17, 23, 25, 13, 22, 31, 29, 28, 25, 28, 15, 2, 18, 21, 16, 26, 14, 19, 10, 22, 26, 20, 25, 17, 20]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[17, 2, 32, 14, 23, 33, 19, 13, 18, 19, 33, 4, 29, 11, 2, 26, 17, 19, 29, 11, 1, 16, 30, 11, 17, 31, 32, 7, 12, 19, 23, 15, 10, 30, 31, 30, 29, 11, 22, 15, 7, 5, 31, 19, 27, 23, 22, 7, 31, 30]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[6, 11, 16, 32, 10, 6, 27, 29, 26, 27, 9, 17, 24, 13, 15, 17, 26, 1, 18, 30, 11, 3, 27, 1, 25, 19, 21, 6, 7, 20, 27, 5, 20, 15, 25, 14, 7, 11, 11, 33, 7, 12, 32, 16, 14, 32, 20, 18, 30, 14]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[5, 27, 18, 24, 25, 4, 30, 23, 32, 21, 21, 21, 31, 1, 30, 31, 6, 32, 33, 26, 7, 11, 30, 25, 13, 19, 7, 32, 33, 9, 22, 2, 32, 20, 24, 13, 24, 31, 19, 3, 10, 17, 10, 28, 21, 7, 11, 1, 4, 29]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[30, 1, 23, 20, 22, 10, 14, 6, 11, 29, 28, 5, 22, 32, 28, 14, 13, 8, 31, 22, 12, 26, 1, 1, 20, 26, 28, 28, 26, 5, 14, 32, 1, 6, 10, 3, 17, 33, 11, 31, 13, 32, 33, 2, 15, 7, 7, 16, 23, 21]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[4, 32, 32, 5, 8, 11, 28, 25, 5, 23, 7, 21, 4, 13, 11, 11, 23, 31, 11, 17, 4, 16, 5, 18, 15, 3, 23, 14, 4, 20, 27, 5, 28, 22, 1, 21, 2, 32, 22, 22, 20, 6, 29, 8, 15, 32, 19, 13, 5, 3]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[17, 15, 27, 24, 22, 32, 30, 19, 7, 30, 15, 19, 25, 14, 6, 8, 30, 8, 22, 28, 24, 12, 16, 1, 8, 11, 28, 31, 16, 17, 22, 7, 17, 30, 28, 10, 3, 28, 13, 5, 32, 29, 8, 3, 2, 16, 13, 32, 19, 16]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[9, 22, 11, 15, 12, 12, 32, 25, 6, 8, 17, 7, 19, 13, 5, 22, 22, 8, 14, 12, 33, 29, 17, 16, 17, 20, 7, 5, 27, 31]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[18, 10, 18, 2, 1, 13, 20, 31, 26, 28]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[24, 18, 30, 27, 5, 27, 14, 1, 1, 31]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[19, 7, 29, 15, 6, 30, 29, 26, 26, 16, 14, 8, 33, 31, 28, 19, 7, 25, 21, 26, 30, 17, 1, 14, 22, 20, 20, 8, 2, 23, 19, 6, 12, 26, 23, 30, 9, 21, 7, 20, 19, 9, 31, 16, 24, 4, 4, 13, 29, 30, 10, 17, 7, 30, 9, 18, 28, 24, 30, 27, 32, 6, 1, 18, 17, 18, 20, 15, 22, 18, 21, 12, 32, 10, 14, 5, 28, 18, 6, 31, 8, 1, 20, 9, 28, 20, 3, 31, 20, 22, 27, 16, 12, 21, 30, 33, 14, 30, 2, 18]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[15, 8, 27, 29, 28, 15, 8, 14, 4, 1, 31, 24, 27, 12, 24, 18, 4, 2, 14, 24, 27, 29, 28, 31, 33, 26, 2, 32, 25, 5, 13, 23, 14, 13, 31, 8, 12, 10, 21, 20, 30, 27, 33, 24, 28, 19, 5, 27, 28, 20, 11, 2, 2, 33, 4, 19, 14, 26, 28, 6, 23, 24, 10, 30, 7, 14, 24, 16, 11, 29, 6, 17, 14, 24, 9, 4, 13, 9, 15, 27, 13, 3, 14, 33, 31, 28, 28, 31, 13, 15, 29, 17, 5, 31, 24, 6, 1, 10, 1, 31]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[15, 25, 7, 15, 27, 8, 31, 31, 24, 8, 7, 4, 25, 33, 9, 4, 19, 6, 2, 32, 24, 18, 10, 10, 8, 21, 18, 32, 30, 15, 6, 11, 7, 8, 7, 12, 20, 16, 14, 3, 10, 27, 9, 11, 16, 20, 28, 33, 7, 18, 15, 31, 23, 12, 4, 15, 9, 22, 23, 20, 1, 25, 3, 25, 30, 30, 19, 23, 2, 2, 3, 9, 16, 3, 24, 11, 17, 20, 5, 15, 20, 22, 5, 3, 28, 24, 3, 25, 19, 15, 17, 33, 25, 1, 33, 4, 12, 33, 30, 1]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[20, 14, 2, 32, 31, 30, 2, 33, 22, 19, 2, 3, 11, 10, 26, 17, 26, 14, 20, 11, 21, 24, 18, 28, 26, 21, 20, 6, 5, 33, 32, 10, 1, 3, 17, 5, 25, 5, 2, 4, 25, 9, 13, 22, 27, 24, 1, 1, 3, 32, 21, 12, 10, 6, 3, 8, 8, 31, 30, 18, 18, 20, 3, 21, 14, 11, 11, 10, 32, 23, 16, 24, 33, 14, 14, 15, 6, 15, 16, 17, 19, 18, 7, 7, 17, 4, 2, 24, 18, 15, 10, 1, 18, 3, 2, 30, 12, 27, 16, 22]
존재하지 않는 값(들): []
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[21, 20, 31, 2, 18, 21, 14, 14, 9, 9, 16, 23, 3, 24, 2, 21, 11, 23, 8, 25, 5, 17, 7, 1, 5, 25, 5, 23, 22, 13, 27, 19, 14, 29, 11, 24, 20, 24, 4, 5, 15, 21, 25, 30, 29, 8, 3, 16, 32, 10, 8, 20, 13, 21, 4, 13, 32, 1, 31, 18, 11, 26, 1, 33, 3, 26, 7, 15, 13, 16, 13, 6, 13, 16, 14, 17, 9, 20, 14, 15, 5, 18, 3, 8, 12, 28, 32, 28, 32, 32, 21, 13, 29, 12, 11, 1, 18, 33, 19, 24]
존재하지 않는 값(들): []
>>> 
>>> 

======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
>>> 
[31, 31, 30, 12, 15, 2, 22, 16, 20, 26, 15, 17, 14, 33, 23, 27, 29, 33, 11, 24, 18, 9, 4, 2, 20, 23, 3, 22, 26, 15, 27, 30, 20, 21, 22, 16, 2, 16, 28, 21, 1, 4, 28, 10, 6, 16, 10, 32, 15, 11, 29, 27, 21, 3, 12, 6, 30, 22, 29, 13, 21, 30, 27, 8, 21, 4, 32, 3, 5, 8, 20, 25, 27, 6, 1, 26, 31, 22, 8, 11, 10, 1, 6, 1, 24, 23, 5, 22, 26, 31, 17, 33, 31, 26, 18, 15, 33, 13, 16, 17]
존재하지 않는 값(들): [7, 19]
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_15_2.py =======
[3, 27, 8, 25, 26, 7, 17, 17, 30, 17, 24, 12, 23, 6, 29, 15, 15, 28, 29, 1, 21, 21, 22, 27, 7, 26, 29, 32, 23, 22, 18, 28, 27, 9, 17, 9, 29, 21, 32, 18, 21, 26, 33, 17, 25, 26, 24, 13, 14, 19, 29, 27, 28, 25, 7, 22, 15, 32, 12, 11, 12, 13, 30, 10, 8, 14, 13, 26, 21, 22, 17, 30, 19, 10, 10, 30, 29, 20, 19, 10, 22, 4, 7, 17, 30, 12, 21, 29, 22, 26, 5, 26, 2, 17, 22, 26, 21, 5, 13, 12]
존재하지 않는 값(들): [16, 31]

>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_16.py ========
[2, 2, 3]
[2, 4, 3]
[2, 4, 6]
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_16.py ========
[2, 4, 6]
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_16.py ========
Traceback (most recent call last):
  File "C:/GitCollection/study/Python/python으로 시작하는/q5_16.py", line 8, in <module>
    times2(nums)
NameError: name 'times2' is not defined
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_16.py ========
[2, 4, 6]

a= [2, 4] b= [6, 8]
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_16.py ========
[2, 4, 6]

a= [2, 4] b= [6, 8]

사과
오렌지
포도
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_16.py ========
[2, 4, 6]

a= [2, 4] b= [6, 8]

사과 오렌지 포도 
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_16.py ========
[2, 4, 6]

a= [2, 4] b= [6, 8]

사과 오렌지 포도 Traceback (most recent call last):
  File "C:/GitCollection/study/Python/python으로 시작하는/q5_16.py", line 31, in <module>
    print('* 과일명 :', fruitdb[i][0], '(', fruitdv[i][1],')원')
NameError: name 'fruitdv' is not defined
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_16.py ========
[2, 4, 6]

a= [2, 4] b= [6, 8]

사과 오렌지 포도 * 과일명 : 사과 ( 1020 )원 * 과일명 : 오렌지 ( 880 )원 * 과일명 : 포도 ( 3160 )원 
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_16.py ========
[2, 4, 6]

a= [2, 4] b= [6, 8]

사과 오렌지 포도 * 과일명 : 사과 ( 1020 )원
* 과일명 : 오렌지 ( 880 )원
* 과일명 : 포도 ( 3160 )원
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_16.py ========
[2, 4, 6]

a= [2, 4] b= [6, 8]

사과 오렌지 포도 
* 과일명 : 사과 ( 1020 )원
* 과일명 : 오렌지 ( 880 )원
* 과일명 : 포도 ( 3160 )원
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_16.py ========
[2, 4, 6]

a= [2, 4] b= [6, 8]

사과 오렌지 포도 

* 과일명 : 사과 ( 1020 )원
* 과일명 : 오렌지 ( 880 )원
* 과일명 : 포도 ( 3160 )원
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_16.py ========
[2, 4, 6]

a= [2, 4] b= [6, 8]

사과 오렌지 포도 

* 과일명 : 사과 ( 1020 )원
* 과일명 : 오렌지 ( 880 )원
* 과일명 : 포도 ( 3160 )원
1686.7원
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_16.py ========
[2, 4, 6]

a= [2, 4] b= [6, 8]

사과 오렌지 포도 

* 과일명 : 사과 ( 1020 )원
* 과일명 : 오렌지 ( 880 )원
* 과일명 : 포도 ( 3160 )원

1686.7원
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_16.py ========
[2, 4, 6]

a= [2, 4] b= [6, 8]

사과 오렌지 포도 

* 과일명 : 사과 ( 1020 )원
* 과일명 : 오렌지 ( 880 )원
* 과일명 : 포도 ( 3160 )원

1686.7원
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_16_6.py =======
금주 번호 : [7, 8, 23, 25, 29, 42]
나의 번호 : [15, 16, 20, 22, 42, 44]
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_17.py ========
('사과', '오렌지', 1020, 880)
('하나', '둘')
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_17.py ========
('사과', '오렌지', 1020, 880)
('하나', '둘')
오렌지
('오렌지', 1020)
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_17.py ========
('사과', '오렌지', 1020, 880)
('하나', '둘')
오렌지
('오렌지', 1020)
Traceback (most recent call last):
  File "C:/GitCollection/study/Python/python으로 시작하는/ex5_17.py", line 12, in <module>
    things = animal, fruits
NameError: name 'animal' is not defined
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_17.py ========
('사과', '오렌지', 1020, 880)
('하나', '둘')
오렌지
('오렌지', 1020)
(('토끼', '사자', '원숭이'), ('사과', '오렌지', 1020, 880))
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_18.py ========
(5, 3)

(12.23, 23.34)
12.23 23.34

Traceback (most recent call last):
  File "C:/GitCollection/study/Python/python으로 시작하는/ex5_18.py", line 18, in <module>
    dice3 = dice1+dice3
NameError: name 'dice3' is not defined
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_18.py ========
(5, 3)

(12.23, 23.34)
12.23 23.34

(3, 2, 5, 3, 4, 6, 1, 4, 2, 3)

>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_19.py ========
True
False

(1, 2, 3, 1, 2, 3)

5
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_19.py ========
True
False

(1, 2, 3, 1, 2, 3)

5

2
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_19.py ========
True
False

(1, 2, 3, 1, 2, 3)

5

2
1
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_19.py ========
True
False

(1, 2, 3, 1, 2, 3)

5

2
1
((6, 1, 4), (5, 2, 1))
Traceback (most recent call last):
  File "C:/GitCollection/study/Python/python으로 시작하는/ex5_19.py", line 28, in <module>
    print(Result[1][1])
NameError: name 'Result' is not defined
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_19.py ========
True
False

(1, 2, 3, 1, 2, 3)

5

2
1
((6, 1, 4), (5, 2, 1))
2
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_19.py ========
True
False

(1, 2, 3, 1, 2, 3)

5

2
1

((6, 1, 4), (5, 2, 1))
2
>>> 
========= RESTART: C:/GitCollection/study/Python/python으로 시작하는/q5_17.py ========
0 0
1 1
2 4
3 9
4 16
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_20.py ========
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_21.py ========
{'지훈': 1234}
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_21.py ========
{'지훈': 1234}
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_21.py ========
{'지훈': 1234}
{'지훈': 1234, '수민': 2345}
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_21.py ========
{'지훈': 1234}
{'지훈': 1234, '수민': 2345}

원본 : {'사과': 1020, '오렌지': 800, '포도': 3160}
사과 삭제 : {'오렌지': 800, '포도': 3160}
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_22.py ========
True
False
2345
None
dict_keys(['현준', '민지'])
dict_values([1234, 2345])
dict_items([('현준', 1234), ('민지', 2345)])
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_22.py ========
원본 : {'현준': 1234, '민지': 2345}
업데이트 : {'현준': 1234, '민지': 2345, '승민': 3456, '유진': 4567}
True
False
2345
None
dict_keys(['현준', '민지', '승민', '유진'])
dict_values([1234, 2345, 3456, 4567])
dict_items([('현준', 1234), ('민지', 2345), ('승민', 3456), ('유진', 4567)])
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_22.py ========
True
False
2345
None
dict_keys(['현준', '민지'])
dict_values([1234, 2345])
dict_items([('현준', 1234), ('민지', 2345)])
원본 : {'현준': 1234, '민지': 2345}
업데이트 : {'현준': 1234, '민지': 2345, '승민': 3456, '유진': 4567}
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_22.py ========
True
False
2345
None
dict_keys(['현준', '민지'])
dict_values([1234, 2345])
dict_items([('현준', 1234), ('민지', 2345)])

원본 : {'현준': 1234, '민지': 2345}
업데이트 : {'현준': 1234, '민지': 2345, '승민': 3456, '유진': 4567}
>>> 
======== RESTART: C:/GitCollection/study/Python/python으로 시작하는/ex5_22.py ========
True
False
2345
None
dict_keys(['현준', '민지'])
dict_values([1234, 2345])
dict_items([('현준', 1234), ('민지', 2345)])

원본 : {'현준': 1234, '민지': 2345}
업데이트 : {'현준': 1234, '민지': 2345, '승민': 3456, '유진': 4567}
이름:준혁, 나이:21, 키172.5
>>> 